app/controllers/competitions_controller.rb

  def index
    @competitions = Competition.all
---
SELECT "competitions".* FROM "competitions"

  def create
    @competition = Competition.new(competition_params)

    respond_to do |format|
      if @competition.save
---
INSERT INTO "competitions" ("name", "c_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test comp"], ["c_date", "2017-08-30"], ["created_at", "2016-08-30 17:30:03.510254"], ["updated_at", "2016-08-30 17:30:03.510254"]]

    def set_competition
      @competition = Competition.find(params[:id])
---
SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT 1  [["id", 1]]